cask_args appdir: '/Applications'

tap 'anomalyco/tap'
tap 'cloudflare/cloudflare'
tap 'emqx/mqttx'
tap 'fairwindsops/tap'
tap 'hashicorp/tap'
tap 'homebrew-ffmpeg/ffmpeg'
tap 'k0sproject/tap'
tap 'kubeshark/kubeshark'
tap 'mdogan/zulu'
tap 'oven-sh/bun'
tap 'pulumi/tap'
tap 'vectordotdev/brew'


##############################
# Terminal, Shell & Core CLI #
##############################
# Prefer GNU userland tools but keep macOS defaults intact.
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'cmake'
brew 'ack'
brew 'grc'
brew 'ssh-copy-id'
brew 'tmux'
brew 'roundup'
brew 'eza'
brew 'mosh'
brew 'zsh'
brew 'readline'
brew 'ripgrep'
brew 'jq'
brew 'qsv'
brew 'fzf'
brew 'zstd'
brew 'guetzli'
brew 'unar'
brew 'chezmoi'
brew 'asciinema'
brew 'spark'
brew 'yq'
brew 'zimfw'
# TLDR provides simplified and community-driven man pages
brew 'tlrc'
cask 'ghostty'


#############################################
# Developer Toolchains & Package Managers   #
#############################################
cask 'zulu@11'
cask 'zulu@17'
cask 'zulu@21'
cask 'zulu@25'
brew 'jenv'
brew 'maven'
brew 'gradle'
brew 'nodenv'
brew 'yarn'
brew 'oven-sh/bun/bun'
brew 'pnpm'
brew 'go'
brew 'goenv'
brew 'go-jsonnet'
brew 'rbenv'
brew 'ruby-build'
brew 'uv'
brew 'pyenv'
brew 'python@3.12'
brew 'python@3.13'
brew 'python@3.14'
brew 'rust'
brew 'luarocks'


#############################
# Apple & Mobile Development #
#############################
brew 'cocoapods'
brew 'xcodegen'
cask 'sf-symbols'
cask 'android-platform-tools'
cask 'flutter'


#####################################
# Developer Workflow & Automation   #
#####################################
brew 'ansible'
brew 'argocd'
brew 'atlas'
brew 'automake'
brew 'cloc'
brew 'difftastic'
brew 'diffoci'
brew 'hadolint'

#############################################
# Source Control, IDEs & Documentation      #
#############################################
brew 'git'
brew 'git-crypt'
brew 'git-lfs'
brew 'onefetch'
brew 'libgit2'
brew 'gh'
brew 'plantuml'
brew 'pandoc'
brew 'poppler'
brew 'vale'
brew 'proselint'
cask 'fork'
cask 'gitup-app'
cask 'github'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'vscodium'
cask 'zed'
cask 'sublime-text'
cask 'staruml'
cask 'monodraw'


###################
# Testing & QA    #
###################
brew 'wrk'
brew 'mockserver'


##################################
# Cloud & Infrastructure          #
##################################
brew 'awscli'
brew 'aws-sam-cli'
brew 'awslogs'
brew 'saml2aws'
brew 'azure-cli'
brew 'cfn-lint'
brew 'cloudflare/cloudflare/cf-terraforming'
brew 'hashicorp/tap/terraform'
brew 'terraformer'
brew 'pulumi'
brew 'infracost'
cask 'aws-vault-binary'
# Install Serverless via npm because the Homebrew formula is deprecated upstream.
# npm install -g serverless


#################################################
# Containers, Kubernetes & Supply Chain Security #
#################################################
cask 'podman-desktop'
cask 'parallels'
brew 'colima'
brew 'lazydocker'
brew 'dive'
brew 'trivy'
brew 'syft'
brew 'grype'
brew 'skopeo'
brew 'whalebrew'
brew 'docker-credential-helper-ecr'
brew 'fairwindsops/tap/pluto'
brew 'k0sproject/tap/k0sctl'
brew 'k9s'
brew 'cilium-cli'
brew 'kubernetes-cli'
brew 'kubeshark'
brew 'kustomize'
brew 'helm'
brew 'tektoncd-cli'
brew 'conftest'


##################################
# Messaging, APIs & Integration  #
##################################
brew 'kafka'
brew 'kcat'
brew 'emqx/mqttx/mqttx-cli'
cask 'mqttx'
cask 'charles'
cask 'bruno'
cask 'ngrok'
cask 'insomnia'


###################################
# Data, Databases & Observability  #
###################################
brew 'pgcli'
brew 'sqlite'
brew 'duckdb'
brew 'datasette'
brew 'vectordotdev/brew/vector'
cask 'dbeaver-community'
cask 'tad'


##################################
# Networking, Security & Access  #
##################################
brew 'dnsmasq'
brew 'netcat'
brew 'nmap'
brew 'socat'
brew 'telnet'
brew 'monit'
brew 'certbot'
brew 'step'
brew 'snyk-cli'
brew 'cloudflared'
brew 'pass'
brew 'ykman'
cask '1password'
cask '1password-cli'
cask 'keybase'
cask 'gpg-suite-no-mail'
cask 'expressvpn'
cask 'cloudflare-warp'
cask 'yubico-authenticator'
cask 'yubico-yubikey-manager'
cask 'blockblock'
cask 'little-snitch'
cask 'viscosity'


############################################
# Downloaders, File Transfer & Filesystems #
############################################
brew 'curl'
brew 'httpie'
brew 'httrack'
brew 'wget'
brew 'yt-dlp'
brew 'monolith'
brew 'rsync'
cask 'synology-drive'
cask 'localsend'
cask 'transmission'
cask 'transmit'
cask 'backblaze'
cask 'maestral'


###########################################
# Media, Graphics & Audio/Video Tools     #
###########################################
brew 'exiftool'
brew 'imagemagick'
brew 'homebrew-ffmpeg/ffmpeg/ffmpeg', args: ['with-fdk-aac', 'with-tools', 'with-freetype', 'with-libass', 'with-libvorbis', 'with-libvpx', 'with-x265']
brew 'gifsicle'
brew 'graphicsmagick'
brew 'jp2a'
brew 'webp'
brew 'graphviz'
brew 'lame'
brew 'theora'
brew 'x264'
cask 'imageoptim'
cask 'imagemin'
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'bambu-studio'
cask 'live-home-3d'
cask 'shapr3d'
cask 'audacity'
cask 'audio-hijack'
cask 'camo-studio'
cask 'handbrake-app'
cask 'iina'
cask 'powerphotos'
cask 'vlc'
cask 'fission'
cask 'soundsource'
cask 'calibre'
cask 'kindle'
cask 'sigil'


######################################################
# Productivity, Communication & Collaboration        #
######################################################
cask 'slack'
cask 'signal'
cask 'grammarly'
cask 'fantastical'
cask 'fastmail'
cask 'godspeed'
cask 'mailmate'
cask 'mimestream'
cask 'microsoft-office'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'onedrive'
cask 'raycast'
cask 'reader'
cask 'linear-linear'
cask 'obsidian'
cask 'standard-notes'
cask 'xmind'
cask 'setapp'
brew 'mas'


#########################
# Browsers & Web Tools  #
#########################
cask 'arc'
cask 'firefox'
cask 'librewolf'
cask 'tor-browser'
cask 'vivaldi'
cask 'choosy'
cask 'coherence-x'
cask 'servo'


################
# AI & LLM     #
################
brew 'anomalyco/tap/opencode'
brew 'gemini-cli'
cask 'chatgpt'
cask 'claude'
cask 'codex'
cask 'commander'
cask 'ollama-app'
cask 'wispr-flow'

########################################
# Utilities & System Enhancements      #
########################################
cask 'alfred'
cask 'launchcontrol'
cask 'hazel'
cask 'the-unarchiver'
cask 'stats'
cask 'microsoft-auto-update'
cask 'rocket'
cask 'emailchemy'
cask 'geekbench'
brew 'duti'


#########
# Fonts #
#########
cask 'font-fira-code'
cask 'font-blex-mono-nerd-font'
cask 'font-geist'
cask 'font-ibm-plex-mono'
cask 'font-ibm-plex-sans'
cask 'font-iosevka-nerd-font'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-victor-mono'
cask 'font-mona-sans'
cask 'font-hubot-sans'
cask 'font-jetbrains-mono'
cask 'font-architects-daughter'
cask 'font-flow-block'
cask 'font-flow-circular'
cask 'font-flow-rounded'
cask 'font-redacted'
cask 'font-redacted-script'


#############
# Quicklook #
#############
# See: https://github.com/sindresorhus/quick-look-plugins
cask 'qlimagesize'
cask 'qlvideo'
cask 'suspicious-package'


######################
# Mac App Store Apps #
######################

## Browsers & Web
mas '1Password for Safari', id: 1569813296
mas 'Ivory', id: 6444602274
mas 'Kagi for Safari', id: 1622835804
mas 'PiPifier', id: 1160374471
mas 'Save to Reader', id: 1640236961
mas 'StopTheMadness Pro', id: 6471380298
mas 'Wipr', id: 1662217862
mas 'xSearch', id: 1579902068

## Productivity & Notes
mas 'Calendar 366 II', id: 1265895169
mas 'Cardhop', id: 1290358394
mas 'Cleft', id: 6479458038
mas 'Craft', id: 1487937127
mas 'Day One', id: 1055511498
mas 'Drafts', id: 1435957248
mas 'Everyday Habit Tracker', id: 1394150432
mas 'Flow', id: 1423210932
mas 'Focused Work', id: 1523968394
mas 'Goodnotes', id: 1444383602
mas 'iA Writer', id: 775737590
mas 'Keynote', id: 361285480
mas 'Magnet', id: 441258766
mas 'MarginNote 3', id: 1423522373
mas 'MarkDownload - Markdown Web Clipper', id: 1554029832
mas 'NotePlan', id: 1505432629
mas 'Numbers', id: 361304891
mas 'Obsidian Web Clipper', id: 6720708363
mas 'OmniFocus', id: 1542143627
mas 'OmniGraffle', id: 1142578753
# mas 'Pages', id: 61309726
mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'Pins', id: 1547106997
mas 'Reeder', id: 1529448980
mas 'reMarkable', id: 1276493162
mas 'Soulver 2', id: 413965349
mas 'Swift Mail', id: 1595671863
mas 'Tab Space', id: 1473726602
mas 'Things', id: 904280696
mas 'TickTick', id: 966085870
mas 'Timery', id: 1425368544
mas 'Todoist', id: 585829637
mas 'Wallaroo', id: 1630565980

## Media & Creativity
mas '3d Scanner App', id: 1419913995
mas 'Cinemagraph Pro', id: 777874532
mas 'Codye', id: 1516894961
mas 'Darkroom', id: 953286746
mas 'Deckset', id: 847496013
mas 'Highlights', id: 1498912833
mas 'iMovie', id: 408981434
mas 'MediaInfo', id: 510620098
mas 'MetaDoctor Pro', id: 992000603
mas 'Mimeo Photos', id: 1282504627
mas 'Mela', id: 1568924476
mas 'Nitro', id: 1591292532
mas 'Pastel', id: 413897608
mas 'Patterns', id: 429449079
mas 'RAW Power', id: 1157116444

## Dev & IT
mas 'Apple Configurator', id: 1037126344
mas 'Developer', id: 640199958
mas 'EasyMQTT', id: 1523099606
mas 'Home Assistant', id: 1099568401
mas 'HomePass', id: 1330266650
mas 'Jira', id: 1475897096
mas 'LanguageTool', id: 1534275760
mas 'Nautik', id: 1672838783
mas 'OTP Auth', id: 1471867429
mas 'Overlap', id: 1516950324
mas 'Screens 5', id: 1663047912
mas 'Server', id: 883878097
mas 'Super Agent', id: 1568262835
mas 'Tailscale', id: 1475387142
mas 'TestFlight', id: 899247664
mas 'Textual 7', id: 1262957439
mas 'Trello', id: 1278508951
mas 'TV Launcher', id: 1622598042
mas 'UTM', id: 1538878817
mas 'Xcode', id: 497799835

## Utilities & Misc
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'Boop', id: 1518425043
mas 'Coinverter', id: 926121450
mas 'DaisyDisk', id: 411643860
mas 'Deliveries', id: 924726344
mas 'ExifPurge', id: 784466108
mas 'Hush', id: 1544743900
mas 'Klib', id: 1196268448
mas 'MusicHarbor', id: 1440405750
mas 'Parcel', id: 375589283
mas 'PodcastSoundboard', id: 1265723161
mas 'WhatsApp', id: 310633997


#################
# Not Automated #
#################
# Xmind 2020
# Bee (JIRA)
